docs/test-reports/perf-raw/redis-cluster-ext-models-mid-2026-04-03.txt
Running 200 requests test @ http://154.40.40.116:8301/v1/models
20 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 779 ms │ 1137 ms │ 2076 ms │ 2448 ms │ 1230.64 ms │ 366.44 ms │ 3165 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 17      │ 21      │ 14.29   │ 6.59   │ 4      │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 2.02 MB │ 2.48 MB │ 1.69 MB │ 779 kB │ 473 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 14

200 requests in 14.01s, 23.7 MB read