docs/test-reports/perf-raw/staging-admin-channels-pressure-20260402-232008.txt
Running 150 requests test @ http://154.40.40.116:8301/api/admin/channels
15 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg     │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────────┼─────────┤
│ Latency │ 3679 ms │ 4478 ms │ 5966 ms │ 6327 ms │ 4605 ms │ 616.33 ms │ 6453 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼─────┼──────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 1      │ 13     │ 3.13   │ 3.85    │ 1      │
├───────────┼─────┼──────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 262 kB │ 3.4 MB │ 817 kB │ 1.01 MB │ 261 kB │
└───────────┴─────┴──────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 48

150 requests in 48.04s, 39.2 MB read