docs/test-reports/perf-raw/staging-admin-channels-stress-20260402-230007.txt
Running 100 requests test @ http://154.40.40.116:8301/api/admin/channels
10 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1149 ms │ 2019 ms │ 3341 ms │ 3341 ms │ 2062.13 ms │ 570.27 ms │ 3682 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%    │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼─────┼──────┼────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 3      │ 10      │ 4.35    │ 3.55   │ 1      │
├───────────┼─────┼──────┼────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 785 kB │ 2.62 MB │ 1.14 MB │ 927 kB │ 261 kB │
└───────────┴─────┴──────┴────────┴─────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 23

100 requests in 23.01s, 26.1 MB read