docs/test-reports/perf-raw/staging-admin-sync-status-pressure-20260402-232008.txt
Running 150 requests test @ http://154.40.40.116:8301/api/admin/sync-status
15 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev  │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼────────┼─────────┤
│ Latency │ 717 ms │ 2795 ms │ 3195 ms │ 3202 ms │ 2602.34 ms │ 660 ms │ 3221 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 2       │ 15      │ 5.56    │ 5.93    │ 1       │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 3.48 kB │ 26.1 kB │ 9.67 kB │ 10.3 kB │ 1.74 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 27

150 requests in 27.03s, 261 kB read