docs/test-reports/perf-raw/staging-admin-sync-status-stress-20260402-230007.txt
Running 100 requests test @ http://154.40.40.116:8301/api/admin/sync-status
10 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬───────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼───────────┼────────┤
│ Latency │ 271 ms │ 308 ms │ 970 ms │ 971 ms │ 379.51 ms │ 200.59 ms │ 973 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴───────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 1       │ 1       │ 29      │ 30      │ 20      │ 12.19   │ 1       │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 1.78 kB │ 1.78 kB │ 51.6 kB │ 53.4 kB │ 35.6 kB │ 21.7 kB │ 1.78 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 5

100 requests in 5.01s, 178 kB read