docs/test-reports/perf-raw/staging-admin-users-pressure-20260402-232008.txt
Running 150 requests test @ http://154.40.40.116:8301/api/admin/users?page=1&pageSize=20
15 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1543 ms │ 2701 ms │ 3491 ms │ 3530 ms │ 2727.14 ms │ 433.67 ms │ 3708 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 5       │ 12      │ 5.18    │ 3.26    │ 1       │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 12.6 kB │ 30.4 kB │ 13.1 kB │ 8.24 kB │ 2.53 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 29

150 requests in 29.03s, 379 kB read