docs/test-reports/perf-raw/staging-admin-users-stress-20260402-230007.txt
Running 100 requests test @ http://154.40.40.116:8301/api/admin/users?page=1&pageSize=20
10 connections


┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 288 ms │ 354 ms │ 1303 ms │ 1308 ms │ 488.27 ms │ 293.26 ms │ 1311 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 21      │ 28      │ 16.67   │ 11.31   │ 2       │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 53.1 kB │ 70.8 kB │ 42.1 kB │ 28.6 kB │ 5.06 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 6

100 requests in 6.01s, 253 kB read