docs/test-reports/perf-raw/staging-models-pressure-20260402-232008.txt
Running 500 requests test @ http://154.40.40.116:8301/api/v1/models
30 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1368 ms │ 3191 ms │ 4670 ms │ 4800 ms │ 3038.07 ms │ 916.25 ms │ 5639 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%    │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼─────┼──────┼────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 7      │ 26      │ 9.62    │ 7.92   │ 1      │
├───────────┼─────┼──────┼────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 866 kB │ 3.22 MB │ 1.19 MB │ 980 kB │ 124 kB │
└───────────┴─────┴──────┴────────┴─────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 52

500 requests in 52.04s, 61.9 MB read