docs/test-reports/perf-raw/staging-models-stress-20260402-230007.txt
Running 300 requests test @ http://154.40.40.116:8301/api/v1/models
20 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 672 ms │ 1668 ms │ 2919 ms │ 3002 ms │ 1614.88 ms │ 588.79 ms │ 3694 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 11      │ 20      │ 11.54   │ 4.63   │ 5      │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 1.38 MB │ 2.51 MB │ 1.45 MB │ 581 kB │ 628 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 26

300 requests in 26.02s, 37.7 MB read