docs/test-reports/perf-raw/staging-nochat-stress-20260402-230007.txt
Running 100 requests test @ http://154.40.40.116:8301/api/v1/chat/completions
10 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 862 ms │ 1505 ms │ 1977 ms │ 1984 ms │ 1496.07 ms │ 278.32 ms │ 2115 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬───────┬───────┬─────────┬─────────┬────────┬───────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%     │ 97.5%   │ Avg    │ Stdev │ Min   │
├───────────┼───────┼───────┼─────────┼─────────┼────────┼───────┼───────┤
│ Req/Sec   │ 2     │ 2     │ 6       │ 9       │ 6.25   │ 2.28  │ 2     │
├───────────┼───────┼───────┼─────────┼─────────┼────────┼───────┼───────┤
│ Bytes/Sec │ 768 B │ 768 B │ 2.31 kB │ 3.46 kB │ 2.4 kB │ 875 B │ 768 B │
└───────────┴───────┴───────┴─────────┴─────────┴────────┴───────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 16

0 2xx responses, 100 non 2xx responses
100 requests in 16.02s, 38.4 kB read