docs/test-reports/perf-raw/staging-zero-balance-stress-20260402-230007.txt
Running 100 requests test @ http://154.40.40.116:8301/api/v1/chat/completions
10 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 748 ms │ 1491 ms │ 2034 ms │ 2038 ms │ 1463.66 ms │ 328.64 ms │ 2062 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬────────┬─────────┬───────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg    │ Stdev   │ Min   │
├───────────┼─────┼──────┼─────────┼─────────┼────────┼─────────┼───────┤
│ Req/Sec   │ 0   │ 0    │ 6       │ 10      │ 6.25   │ 2.73    │ 2     │
├───────────┼─────┼──────┼─────────┼─────────┼────────┼─────────┼───────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 2.31 kB │ 3.84 kB │ 2.4 kB │ 1.05 kB │ 768 B │
└───────────┴─────┴──────┴─────────┴─────────┴────────┴─────────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 16

0 2xx responses, 100 non 2xx responses
100 requests in 16.02s, 38.4 kB read